#include <iostream>

using namespace std;

void max_sum_div()
{
    /**
    1. Считать числа
    2. Вывести все пары
    3. Вместо пары - суммы
    4. делимость сумм
    5. Только наибольшая сумма
    */
}


int main()
{
    cout << "Hello world!" << endl;
    return 0;
}
